JerrickRowe/stm32-bootloader/projects/STM32F407-OWL/source/main.c
	PRINT_RAW("Create \"%s\"......", UPGRADE_FILENAME);
	fr = f_open(&upgrade_file, UPGRADE_FILENAME, FA_READ | FA_WRITE | FA_CREATE_ALWAYS);
    if(fr != FR_OK){
		PRINT_INF("FAILED");
	}else{
		
		PRINT_INF("DONE");
		f_close(&upgrade_file);
	}
	return false;
	
	PRINT_RAW("Finding \"%s\"......", UPGRADE_FILENAME);
	fr = f_stat(UPGRADE_FILENAME, &file_info);
    if(fr != FR_OK){
		PRINT_INF("NOTFOUND");
        return false;
	}
	PRINT_INF("FOUND");
	PRINT_INF(	"File info: %s %dbytes"
	,	file_info.fname
	,	file_info.fsize
	);
	
	PRINT_RAW("Opening \"%s\"......", UPGRADE_FILENAME);
	fr = f_open(&upgrade_file, UPGRADE_FILENAME, FA_READ);
	if( fr != FR_OK ){
		PRINT_INF("FAILED");
		return false;
	}
	PRINT_INF("DONE");
	
	PRINT_RAW("Verifying upgrade file......");
	if( VerifyUpgradeFile(&upgrade_file) == false ){
		PRINT_INF("FAILED");
		f_close(&upgrade_file);
		PRINT_RAW("Delete %s........", UPGRADE_FILENAME);
		f_unlink(UPGRADE_FILENAME);
		fr = f_stat(UPGRADE_FILENAME, &file_info);
		if(fr != FR_OK){
			PRINT_INF("DONE");
		}else{
			PRINT_INF("FAILED");
		}
		return false;
	}
	PRINT_INF("PASS");
	
	
	
	Copy_App2_To_App1();
	f_close(&upgrade_file);
	return true;
}



/* Main ----------------------------------------------------------------------*/
int main(void)
{
    HAL_Init();
    GPIO_Startup();

	Console_Init();
	
	led_init();
    PRINT_RAW("%s\r\n",get_version_string());

	led_allon();
	
	
	MountFilesystem();

	
	/*
	char *cwd[50];
	f_getcwd(cwd,50);
	PRINT_RAW("Current path: \"%s\"\r\n", cwd);
	
	if( UpdateApp2() == true ){
		PRINT_RAW("Launching new app.\r\n");
		// De-initialize bootloader hardware & peripherals
		SD_DeInit();
		GPIO_DeInit();
		// Launch application 
		Bootloader_JumpToApp1();
	}
	*/
	static bool app1_available = false;
	static bool app2_available = false;

	PRINT_RAW("Checking for App 1......");
    // Check if there is application in user flash area
    if(Bootloader_CheckForApp1() == BL_OK){
#if(USE_CHECKSUM)
		// Verify application checksum 
		if(Bootloader_IsApp1ChecksumValid() != BL_OK){
			PRINT_RAW("BAD");
		}else{
			PRINT_RAW("PASS");
			app1_available = true;
		}
#endif
	}else{
		PRINT_RAW("NOTFOUND");
	}
	PRINT_RAW("\r\n");

	PRINT_RAW("Checking for App 2......");
    // Check if there is application in user flash area
    if(Bootloader_CheckForApp2() == BL_OK){
#if(USE_CHECKSUM)
		// Verify application checksum 
		if(Bootloader_IsApp2ChecksumValid() != BL_OK){
			PRINT_RAW("BAD");
		}else{
			PRINT_RAW("PASS");
			app2_available = true;
		}
#endif
	}else{
		PRINT_RAW("NOTFOUND");
	}
	PRINT_RAW("\r\n");

	// Check if backup app are the same.
	bool isApp2TheSameAsApp1 = false;
	if( app1_available && app2_available ){
		PRINT_RAW("Comparing App1 and App2......");
		if( memcmp( APP1_ADDRESS, APP2_ADDRESS, APP2_SIZE ) == 0 ){
			isApp2TheSameAsApp1 = true;
			PRINT_RAW("Same\r\n");
			PRINT_RAW("Launching App 1.\r\n");
			// De-initialize bootloader hardware & peripherals
			SD_DeInit();
			GPIO_DeInit();
			// Launch application 
			Bootloader_JumpToApp1();
		}else{
			PRINT_INF("Different");
			Copy_App2_To_App1();
			PRINT_INF("Launching App 1.");
			// De-initialize bootloader hardware & peripherals
			SD_DeInit();
			GPIO_DeInit();
			// Launch application 
			Bootloader_JumpToApp1();
		}
	}
	
	// Recover from backup app
	while( !app1_available && app2_available ){
		
		Copy_App2_To_App1();
		
		if(Bootloader_CheckForApp1() == BL_OK){
	#if(USE_CHECKSUM)
			// Verify application checksum 
			if(Bootloader_IsApp1ChecksumValid() == BL_OK){
				app1_available = true;
				PRINT_RAW("Launching App 1.\r\n");
				SD_DeInit();
				GPIO_DeInit();
				// Launch application 
				Bootloader_JumpToApp1();
			}
	#endif
		}else{
			PRINT_RAW("Failed to recover, retry.\r\n");
		}
		HAL_Delay(2000);
	}
	
	
	// Backup current app 1
	if( app1_available && !app2_available ){
		PRINT_RAW("Launching App 1.\r\n");
		SD_DeInit();
		GPIO_DeInit();
		// Launch application 
		Bootloader_JumpToApp1();
	}
	
    // No application found
    PRINT_INF("No application in flash.");
    while(1){
        setAllPixelColor( 20,20,20 );
        HAL_Delay(150);
        setAllPixelColor( 0,0,0 );
        HAL_Delay(150);
    }
}

/*** Bootloader ***************************************************************/

void Enter_Bootloader(void)
{
//    FRESULT  fr;
//    UINT     num;
//    uint8_t  i;
//    uint8_t  status;
//    uint64_t data;
//    uint32_t cntr;
//    uint32_t addr;
//    char     msg[40] = {0x00};

//    /* Check for flash write protection */
//    if(Bootloader_GetProtectionStatus() & BL_PROTECTION_WRP)
//    {
//        PRINT_INF("Application space in flash is write protected.");
//        PRINT_INF("Press button to disable flash write protection...");
//        LED_R_ON();
//        for(i = 0; i < 100; ++i)
//        {
//            LED_Y_TG();
//            HAL_Delay(50);
//            if(IS_BTN_PRESSED())
//            {
//                PRINT_INF("Disabling write protection and generating system "
//                      "reset...");
//                Bootloader_ConfigProtection(BL_PROTECTION_NONE);
//            }
//        }
//        LED_R_OFF();
//        LED_Y_OFF();
//        PRINT_INF("Button was not pressed, write protection is still active.");
//        PRINT_INF("Exiting Bootloader.");
//        return;
//    }

//    /* Initialize SD card */
//    if(SD_Init())
//    {
//        /* SD init failed */
//        PRINT_INF("SD card cannot be initialized.");
//        return;
//    }

//    /* Mount SD card */
//    fr = f_mount(&SDFatFs, (TCHAR const*)SDPath, 1);
//    if(fr != FR_OK)
//    {
//        /* f_mount failed */
//        PRINT_INF("SD card cannot be mounted.");
//        sprintf(msg, "FatFs error code: %u", fr);
//        PRINT_INF("%s",msg);
//        return;
//    }
//    PRINT_INF("SD mounted.");

//    /* Open file for programming */
//    fr = f_open(&SDFile, CONF_FILENAME, FA_READ);
//    if(fr != FR_OK)
//    {
//        /* f_open failed */
//        PRINT_INF("File cannot be opened.");
//        sprintf(msg, "FatFs error code: %u", fr);
//        PRINT_INF("%s",msg);

//        SD_Eject();
//        PRINT_INF("SD ejected.");
//        return;
//    }
//    PRINT_INF("Software found on SD.");

//    /* Check size of application found on SD card */
//    if(Bootloader_CheckSize(f_size(&SDFile)) != BL_OK)
//    {
//        PRINT_INF("Error: app on SD card is too large.");

//        f_close(&SDFile);
//        SD_Eject();
//        PRINT_INF("SD ejected.");
//        return;
//    }
//    PRINT_INF("App size OK.");

//    /* Step 1: Init Bootloader and Flash */
//    Bootloader_Init();

//    /* Step 2: Erase Flash */
//    PRINT_INF("Erasing flash...");
//    LED_Y_ON();
//    Bootloader_Erase();
//    LED_Y_OFF();
//    PRINT_INF("Flash erase finished.");

