JerrickRowe/stm32-bootloader/projects/STM32F407-OWL/source/main.c
//    /* If BTN is pressed, then skip programming */
//    if(IS_BTN_PRESSED())
//    {
//        PRINT_INF("Programming skipped.");

//        f_close(&SDFile);
//        SD_Eject();
//        PRINT_INF("SD ejected.");
//        return;
//    }

//    /* Step 3: Programming */
//    PRINT_INF("Starting programming...");
//    LED_Y_ON();
//    cntr = 0;
//    Bootloader_FlashBegin();
//    do
//    {
//        data = 0xFFFFFFFFFFFFFFFF;
//        fr   = f_read(&SDFile, &data, 8, &num);
//        if(num)
//        {
//            status = Bootloader_FlashNext(data);
//            if(status == BL_OK)
//            {
//                cntr++;
//            }
//            else
//            {
//                sprintf(msg, "Programming error at: %lu byte", (cntr * 8));
//				PRINT_INF("%s",msg);

//                f_close(&SDFile);
//                SD_Eject();
//                PRINT_INF("SD ejected.");

//                LED_G_OFF();
//                LED_Y_OFF();
//                return;
//            }
//        }
//        if(cntr % 256 == 0)
//        {
//            /* Toggle green LED during programming */
//            LED_G_TG();
//        }
//    } while((fr == FR_OK) && (num > 0));

//    /* Step 4: Finalize Programming */
//    Bootloader_FlashEnd();
//    f_close(&SDFile);
//    LED_G_OFF();
//    LED_Y_OFF();
//    PRINT_INF("Programming finished.");
//    sprintf(msg, "Flashed: %lu bytes.", (cntr * 8));
//    PRINT_INF("%s",msg);

//    /* Open file for verification */
//    fr = f_open(&SDFile, CONF_FILENAME, FA_READ);
//    if(fr != FR_OK)
//    {
//        /* f_open failed */
//        PRINT_INF("File cannot be opened.");
//        sprintf(msg, "FatFs error code: %u", fr);
//        PRINT_INF("%s",msg);

//        SD_Eject();
//        PRINT_INF("SD ejected.");
//        return;
//    }

//    /* Step 5: Verify Flash Content */
//    addr = APP_ADDRESS;
//    cntr = 0;
//    do
//    {
//        data = 0xFFFFFFFFFFFFFFFF;
//        fr   = f_read(&SDFile, &data, 4, &num);
//        if(num)
//        {
//            if(*(uint32_t*)addr == (uint32_t)data)
//            {
//                addr += 4;
//                cntr++;
//            }
//            else
//            {
//                sprintf(msg, "Verification error at: %lu byte.", (cntr * 4));
//				PRINT_INF("%s",msg);

//                f_close(&SDFile);
//                SD_Eject();
//                PRINT_INF("SD ejected.");

//                LED_G_OFF();
//                return;
//            }
//        }
//        if(cntr % 256 == 0)
//        {
//            /* Toggle green LED during verification */
//            LED_G_TG();
//        }
//    } while((fr == FR_OK) && (num > 0));
//    PRINT_INF("Verification passed.");
//    LED_G_OFF();

//    /* Eject SD card */
//    SD_Eject();
//    PRINT_INF("SD ejected.");

//    /* Enable flash write protection */
//#if(USE_WRITE_PROTECTION)
//    PRINT_INF("Enablig flash write protection and generating system reset...");
//    if(Bootloader_ConfigProtection(BL_PROTECTION_WRP) != BL_OK)
//    {
//        PRINT_INF("Failed to enable write protection.");
//        PRINT_INF("Exiting Bootloader.");
//    }
//#endif
}

/*** SD Card ******************************************************************/
uint8_t SD_Init(void)
{
//    SDCARD_ON();

//    if(FATFS_Init())
//    {
//        /* Error */
//        return 1;
//    }

    if(BSP_SD_Init())
    {
        /* Error */
        return 2;
    }

    return 0;
}

void SD_DeInit(void)
{
    BSP_SD_DeInit();
//    FATFS_DeInit();
//    SDCARD_OFF();
}

void SD_Eject(void)
{
    f_mount(NULL, (TCHAR const*)SDPath, 0);
}

/*** GPIO Configuration ***/
void GPIO_Startup(void)
{
    GPIO_InitTypeDef GPIO_InitStruct;

    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOC_CLK_ENABLE();

    /* Configure GPIO pin output levels */
    HAL_GPIO_WritePin(LED_G_Port, LED_G_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(LED_Y_Port, LED_Y_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(LED_R_Port, LED_R_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(SD_PWR_Port, SD_PWR_Pin, GPIO_PIN_SET);

    /* LED_G_Pin, LED_Y_Pin, LED_R_Pin */
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;

    GPIO_InitStruct.Pin = LED_G_Pin;
    HAL_GPIO_Init(LED_G_Port, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = LED_Y_Pin;
    HAL_GPIO_Init(LED_Y_Port, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = LED_R_Pin;
    HAL_GPIO_Init(LED_R_Port, &GPIO_InitStruct);

    /* SD Card Power Pin */
    GPIO_InitStruct.Pin   = SD_PWR_Pin;
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(SD_PWR_Port, &GPIO_InitStruct);

    /* User Button */
    GPIO_InitStruct.Pin   = BTN_Pin;
    GPIO_InitStruct.Mode  = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull  = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(BTN_Port, &GPIO_InitStruct);
}
void GPIO_DeInit(void)
{
    HAL_GPIO_DeInit(BTN_Port, BTN_Pin);
    HAL_GPIO_DeInit(LED_G_Port, LED_G_Pin);
    HAL_GPIO_DeInit(LED_Y_Port, LED_Y_Pin);
    HAL_GPIO_DeInit(LED_R_Port, LED_R_Pin);
    HAL_GPIO_DeInit(SD_PWR_Port, SD_PWR_Pin);

    __HAL_RCC_GPIOB_CLK_DISABLE();
    __HAL_RCC_GPIOC_CLK_DISABLE();
}


/*** Console Configuration ***/
static USART_HandleTypeDef console_usart_handle;
void Console_Init(void)
{
	USART_HandleTypeDef *handle = &console_usart_handle;
	RCC_PeriphCLKInitTypeDef clk_init;
	GPIO_InitTypeDef GPIO_InitStructure;
	
	__HAL_RCC_GPIOD_CLK_ENABLE();
	__HAL_RCC_USART2_CLK_ENABLE();
	
	handle->Instance = USART2;
	handle->State = HAL_USART_STATE_RESET;
	handle->Init.BaudRate = 921600;
	handle->Init.StopBits = USART_STOPBITS_1;
	handle->Init.WordLength = USART_WORDLENGTH_8B;
	handle->Init.Parity = USART_PARITY_NONE;
	handle->Init.Mode = USART_MODE_TX_RX;
	HAL_USART_Init(&console_usart_handle);
	
	
	GPIO_InitStructure.Pin   = GPIO_PIN_5;	// Tx
	GPIO_InitStructure.Mode  = GPIO_MODE_AF_PP;
	GPIO_InitStructure.Speed = GPIO_SPEED_FAST;
	GPIO_InitStructure.Alternate = GPIO_AF7_USART2;
	GPIO_InitStructure.Pull  = GPIO_PULLUP;
	HAL_GPIO_Init( GPIOD, &GPIO_InitStructure );
	
	GPIO_InitStructure.Pin   = GPIO_PIN_6;	// Rx
	GPIO_InitStructure.Mode  = GPIO_MODE_AF_OD;
	GPIO_InitStructure.Speed = GPIO_SPEED_FAST;
	GPIO_InitStructure.Alternate = GPIO_AF7_USART2;
	GPIO_InitStructure.Pull  = GPIO_PULLUP;
	HAL_GPIO_Init( GPIOD, &GPIO_InitStructure );
}

